from decimal import Decimal

DEPARTMENTS = [
    'Механик', 
    'Авто хяналтын бүс (АКП)', 
    'Засвар 1', 
    'Засвар 2', 
    'Хос дугуй', 
    'Тэргэнцэр', 
    'Авто угсраа'
]

DEPARTMENT_CHOICES = [
    ('Механик', 'Механик'),
    ('Авто хяналтын бүс (АКП)', 'Авто хяналтын бүс (АКП)'),
    ('Засвар 1', 'Засвар 1'),
    ('Засвар 2', 'Засвар 2'),
    ('Хос дугуй', 'Хос дугуй'),
    ('Тэргэнцэр', 'Тэргэнцэр'),
    ('Авто угсраа', 'Авто угсраа'),
]

RANK_CHOICES = [
    (3, '3'),
    (4, '4'),
    (5, '5'),
    (6, '6'),
]

RANK_TO_MONEY = {
    3: Decimal('8448.55'),
    4: Decimal('9616.24'),
    5: Decimal('11127.36'),
    6: Decimal('13187.98'),
}

TYPE_WORK_CHOICES = [
    ('84', '84'),
    ('29', '29'),
    ('ТҮГ', 'ТҮГ'),
    ('Нөөц', 'Нөөц'),
    ('Завод', 'Завод'),
    ('Депо', 'Депо'),
]